DataProcessors/ДашбордПланФактБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ДашбордПланФактБюджета</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцПлана</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПлана</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеФакта</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ДашбордПланФактБюджета/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ ЗначениеЗаполнено(Объект.МесяцПлана) Тогда
		Объект.МесяцПлана = НачалоМесяца(ТекущаяДата());
	КонецЕсли;

	ИнициализироватьДанные();

КонецПроцедуры


&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры


&НаСервере
Процедура СформироватьНаСервере()

	Если НЕ ЗначениеЗаполнено(Объект.Пользователь) Тогда
		Сообщить("Выберите пользователя.");
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.МесяцПлана) Тогда
		Сообщить("Выберите месяц.");
		Возврат;
	КонецЕсли;

	Объект.МесяцПлана = НачалоМесяца(Объект.МесяцПлана);

	ИнициализироватьДанные();
	ЗаполнитьТаблицуПлана();
	ЗаполнитьТаблицуФакта();
	СобратьДиаграммыИзТаблиц();

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// Инициализация таблиц

&НаСервере
Процедура ИнициализироватьДанные()

	ТабПлан = Новый ТаблицаЗначений;
	ТабПлан.Колонки.Добавить("Статья");
	ТабПлан.Колонки.Добавить("Сумма");

	ТабФакт = Новый ТаблицаЗначений;
	ТабФакт.Колонки.Добавить("Статья");
	ТабФакт.Колонки.Добавить("Сумма");

	ЗначениеВРеквизитФормы(ТабПлан, "Объект.ДанныеПлана");
	ЗначениеВРеквизитФормы(ТабФакт, "Объект.ДанныеФакта");

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// План

&НаСервере
Процедура ЗаполнитьТаблицуПлана()

	ТабПлан = РеквизитФормыВЗначение("Объект.ДанныеПлана");

	// 1) Категории из проведенного ПланаБюджетаМесяца
	ЗапросКат = Новый Запрос;
	ЗапросКат.Текст =
"ВЫБРАТЬ
|	ВЫБОР
|		КОГДА Строки.Категория.ЭтоГруппа ТОГДА Строки.Категория
|		ИНАЧЕ Строки.Категория.Родитель
|	КОНЕЦ КАК Папка,
|	СУММА(Строки.Сумма) КАК Сумма
|ИЗ
|	Документ.ПланБюджетаМесяца КАК Док
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПланБюджетаМесяца.ПланПоКатегориям КАК Строки
|		ПО Док.Ссылка = Строки.Ссылка
|ГДЕ
|	Док.Проведен
|	И Док.Пользователь = &Пользователь
|	И НАЧАЛОПЕРИОДА(Док.МесяцПлана, МЕСЯЦ) = &Месяц
|СГРУППИРОВАТЬ ПО
|	ВЫБОР
|		КОГДА Строки.Категория.ЭтоГруппа ТОГДА Строки.Категория
|		ИНАЧЕ Строки.Категория.Родитель
|	КОНЕЦ";

	ЗапросКат.УстановитьПараметр("Пользователь", Объект.Пользователь);
	ЗапросКат.УстановитьПараметр("Месяц", Объект.МесяцПлана);

	ВыбКат = ЗапросКат.Выполнить().Выбрать();
	Пока ВыбКат.Следующий() Цикл
		Стр = ТабПлан.Добавить();
		Стр.Статья = ?(ЗначениеЗаполнено(ВыбКат.Папка), ВыбКат.Папка.Наименование, "Без папки");
		Стр.Сумма = ?(ЗначениеЗаполнено(ВыбКат.Сумма), ВыбКат.Сумма, 0);
	КонецЦикла;

	// 2) Активы и валюта из регистра итогов
	ЗапросИтоги = Новый Запрос;
	ЗапросИтоги.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Итоги.ПланАктивы КАК ПланАктивы,
	|	Итоги.ПланВалюты КАК ПланВалюты
	|ИЗ
	|	РегистрСведений.ИтогиПланаМесяца КАК Итоги
	|ГДЕ
	|	Итоги.Пользователь = &Пользователь
	|	И Итоги.Месяц = &Месяц
	|УПОРЯДОЧИТЬ ПО
	|	Итоги.Период УБЫВ";

	ЗапросИтоги.УстановитьПараметр("Пользователь", Объект.Пользователь);
	ЗапросИтоги.УстановитьПараметр("Месяц", Объект.МесяцПлана);

	ВыбИтоги = ЗапросИтоги.Выполнить().Выбрать();
	Если ВыбИтоги.Следующий() Тогда

		Если ВыбИтоги.ПланАктивы > 0 Тогда
			Стр = ТабПлан.Добавить();
			Стр.Статья = "Активы";
			Стр.Сумма = ВыбИтоги.ПланАктивы;
		КонецЕсли;

		Если ВыбИтоги.ПланВалюты > 0 Тогда
			Стр = ТабПлан.Добавить();
			Стр.Статья = "Валюта";
			Стр.Сумма = ВыбИтоги.ПланВалюты;
		КонецЕсли;

	КонецЕсли;

	ЗначениеВРеквизитФормы(ТабПлан, "Объект.ДанныеПлана");

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// Факт

&НаСервере
Процедура ЗаполнитьТаблицуФакта()

	ТабФакт = РеквизитФормыВЗначение("Объект.ДанныеФакта");

	НачПериода = НачалоМесяца(Объект.МесяцПлана);
	КонПериода = КонецМесяца(Объект.МесяцПлана);

	// 1) Категории (Расход)
	ЗапросФКат = Новый Запрос;
	ЗапросФКат.Текст =
"ВЫБРАТЬ
|	ВЫБОР
|		КОГДА Расход.Категория.ЭтоГруппа ТОГДА Расход.Категория
|		ИНАЧЕ Расход.Категория.Родитель
|	КОНЕЦ КАК Папка,
|	СУММА(Расход.Сумма) КАК Сумма
|ИЗ
|	Документ.Расход КАК Расход
|ГДЕ
|	Расход.Проведен
|	И Расход.Пользователь = &Пользователь
|	И Расход.Дата МЕЖДУ &НачПериода И &КонПериода
|СГРУППИРОВАТЬ ПО
|	ВЫБОР
|		КОГДА Расход.Категория.ЭтоГруппа ТОГДА Расход.Категория
|		ИНАЧЕ Расход.Категория.Родитель
|	КОНЕЦ";

	ЗапросФКат.УстановитьПараметр("Пользователь", Объект.Пользователь);
	ЗапросФКат.УстановитьПараметр("НачПериода", НачПериода);
	ЗапросФКат.УстановитьПараметр("КонПериода", КонПериода);

	ВыбФКат = ЗапросФКат.Выполнить().Выбрать();
	Пока ВыбФКат.Следующий() Цикл
		Стр = ТабФакт.Добавить();
		Стр.Статья = ?(ЗначениеЗаполнено(ВыбФКат.Папка), ВыбФКат.Папка.Наименование, "Без папки");
		Стр.Сумма = ?(ЗначениеЗаполнено(ВыбФКат.Сумма), ВыбФКат.Сумма, 0);
	КонецЦикла;

	// 2) Активы (ПриобретениеАктива)
	ЗапросФАк = Новый Запрос;
	ЗапросФАк.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Док.Сумма), 0) КАК Сумма
	|ИЗ
	|	Документ.ПриобретениеАктива КАК Док
	|ГДЕ
	|	Док.Проведен
	|	И Док.Пользователь = &Пользователь
	|	И Док.Дата МЕЖДУ &НачПериода И &КонПериода";

	ЗапросФАк.УстановитьПараметр("Пользователь", Объект.Пользователь);
	ЗапросФАк.УстановитьПараметр("НачПериода", НачПериода);
	ЗапросФАк.УстановитьПараметр("КонПериода", КонПериода);

	ВыбФАк = ЗапросФАк.Выполнить().Выбрать();
	Если ВыбФАк.Следующий() И ВыбФАк.Сумма > 0 Тогда
		Стр = ТабФакт.Добавить();
		Стр.Статья = "Активы";
		Стр.Сумма = ВыбФАк.Сумма;
	КонецЕсли;

	// 3) Валюта (ОбменВалюты, Покупка)
	ЗапросФВал = Новый Запрос;
	ЗапросФВал.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Док.СуммаВРублях), 0) КАК Сумма
	|ИЗ
	|	Документ.ОбменВалюты КАК Док
	|ГДЕ
	|	Док.Проведен
	|	И Док.Пользователь = &Пользователь
	|	И Док.Дата МЕЖДУ &НачПериода И &КонПериода
	|	И Док.ТипОперации = &ТипОперации";

	ЗапросФВал.УстановитьПараметр("Пользователь", Объект.Пользователь);
	ЗапросФВал.УстановитьПараметр("НачПериода", НачПериода);
	ЗапросФВал.УстановитьПараметр("КонПериода", КонПериода);
	ЗапросФВал.УстановитьПараметр("ТипОперации", Перечисления.ТипыВалютныхОпераций.Покупка);

	ВыбФВал = ЗапросФВал.Выполнить().Выбрать();
	Если ВыбФВал.Следующий() И ВыбФВал.Сумма > 0 Тогда
		Стр = ТабФакт.Добавить();
		Стр.Статья = "Валюта";
		Стр.Сумма = ВыбФВал.Сумма;
	КонецЕсли;

	ЗначениеВРеквизитФормы(ТабФакт, "Объект.ДанныеФакта");

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// Диаграммы: Гистограммы

&НаСервере
Процедура СобратьДиаграммыИзТаблиц()

	ТабПлан = РеквизитФормыВЗначение("Объект.ДанныеПлана");
	ТабФакт = РеквизитФормыВЗначение("Объект.ДанныеФакта");

	// ПЛАН
	Попытка
		ДиагрПланЛок = Новый Диаграмма;
		ДиагрПланЛок.ТипДиаграммы = ТипДиаграммы.Гистограмма;

		СерияПлан = ДиагрПланЛок.Серии.Добавить("План");

	Для Каждого СтрПлан Из ТабПлан Цикл
    // 1. Принудительно в число
    ТекСумма = Число(СтрПлан.Сумма); 

    Если ТекСумма = 0 Тогда
        Продолжить;
    КонецЕсли;

    // 2. Добавляем точку (Статью)
    ТочкаПлан = ДиагрПланЛок.Точки.Добавить(Строка(СтрПлан.Статья));
    
    // 3. ПРАВИЛЬНЫЙ ПОРЯДОК: Точка, Серия, Значение
    ДиагрПланЛок.УстановитьЗначение(ТочкаПлан, СерияПлан, ТекСумма);
КонецЦикла;
		ДиаграммаПлан = ДиагрПланЛок;

	Исключение
		Сообщить("Ошибка построения диаграммы ПЛАН: " + ОписаниеОшибки());
	КонецПопытки;


	// ФАКТ
	Попытка
		ДиагрФактЛок = Новый Диаграмма;
		ДиагрФактЛок.ТипДиаграммы = ТипДиаграммы.Гистограмма;

		СерияФакт = ДиагрФактЛок.Серии.Добавить("Факт");

		Для Каждого СтрФакт Из ТабФакт Цикл
    ТекСумма = Число(СтрФакт.Сумма);

    Если ТекСумма = 0 Тогда
        Продолжить;
    КонецЕсли;

    ТочкаФакт = ДиагрФактЛок.Точки.Добавить(Строка(СтрФакт.Статья));
    
    // ПРАВИЛЬНЫЙ ПОРЯДОК: Точка, Серия, Значение
    ДиагрФактЛок.УстановитьЗначение(ТочкаФакт, СерияФакт, ТекСумма);
КонецЦикла;
		ДиаграммаФакт = ДиагрФактЛок;

	Исключение
		Сообщить("Ошибка построения диаграммы ФАКТ: " + ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры
